const stadiumMap: Record<number, string> = {
  1: '서울 월드컵 경기장',
  2: '울산 문수 축구경기장',
  3: '전주 월드컵 경기장',
  4: '대전 월드컵 경기장',
  5: '포항 스틸야드',
  6: '대구 iM뱅크PARK',
  7: '광주 축구 전용 경기장',
  8: '강릉 하이원 아레나',
  9: '김천 종합 운동장',
  10: '제주 월드컵 경기장',
  11: '수원 종합 운동장',
  12: '안양 종합 운동장',
  13: '수원 월드컵 경기장',
  14: '창원 축구센터',
  15: '부천 종합 운동장',
  16: '천안 종합 운동장',
  17: '인천 축구 전용 경기장',
  18: '안산 와~ 스타디움',
  19: '김포 솔터 축구장',
  20: '화성 종합 경기타운',
  21: '이순신 종합운동장',
  22: '탄천 종합 운동장',
  23: '목동 종합 운동장',
  24: '광양 축구 전용 구장',
  25: '청주 종합 경기장',
  26: '구덕운동장',
}

export function getStadiumNameById(id?: number): string {
  return id ? stadiumMap[id] || '알 수 없음' : '알 수 없음'
}
